haliskilic/carcluster/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Console: USB-Serial-JTAG (kart "USB" portu)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Flash 16 MB QIO
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# Octal PSRAM 80 MHz (rgb_test ile aynı, çalıştığı doğrulandı)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# === PERF Bundle (Yol A — review-driven optimizations) ===
# Compiler -O2 (default -Og) — %5-15 CPU kazanımı
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# LVGL hot path'leri IRAM'de — render fast
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y

# LVGL memcpy/memset → ESP-IDF Xtensa-optimize sürümü
CONFIG_LV_MEMCPY_MEMSET_STD=y

# FreeRTOS tick rate — pdMS_TO_TICKS doğru çözünürlük için 1ms tick
CONFIG_FREERTOS_HZ=1000

# Octal PSRAM 64-byte burst ile data cache eşleşmesi (Espressif tavsiyesi)
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# RGB LCD — flash/NVS yazımı sırasında drift önleme
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y

# Daha büyük partition (LVGL build için)
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Main stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

CONFIG_LV_MEM_SIZE_KILOBYTES=128

# LVGL fonts
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_LOG=n

# NOT: WiFi/Telnet desteği bu sürümde devre dışı (internal demo mode).
# WiFi/telnet kodu git history'de korunuyor, ihtiyaç olursa geri eklenebilir.
